Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་ནི་འབྱོར་གྲགས་ཞེས་བྱའོ། །
en: Famed Wealth will be his son.

source: རིམ་གྲོ་པ་ནི་འཕགས་བྱིན་འོད་ཅེས་བྱའོ། །
en: Light of the Gift of the Noble will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Immutable Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་མཆོག་སེམས་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of the Mind of Supreme Divinity will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བརྒྱད་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དགུ་འབུམ་མོ། །གསུམ་པ་ལ་ནི་ས་ཡའོ། །
en: In the first congregation there will be eight hundred thousand hearers, in the second there will be nine hundred thousand, and in the third there will be one million.

source: དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་འོད་སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་འབྱེད་པའི་སྡེ་ཞེས་བྱའོ། །
en: “The thus-gone Velāmaprabha will be born in a place called Force of Discernment.

source: ཡབ་ནི་གྲགས་པ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Fame will be his father.

source: ཡུམ་ནི་སེང་གེའི་ང་རོ་ཞེས་བྱའོ། །
en: Lion’s Roar will be his mother.

source: སྲས་ནི་ཕྱོགས་མཆོད་ཅེས་བྱའོ། །
en: Universal Worship will be his son.

source: རིམ་གྲོ་པ་ནི་དྲང་སྲོང་བློ་གྲོས་འགྲོ་ཞེས་བྱའོ། །
en: Movement of the Sage’s Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཤེས་གཉེན་མཐའ་ཡས་སྟོབས་ཞེས་བྱའོ། །
en: Friend of Infinite Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཛེས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Beauty will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་འབུམ་སྟེ། རེ་རེ་པོ་ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་དོ། །
en: There will be one hundred thousand consecutive congregations, each of them gathering infinitely many irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་དྲན་པའི་དབང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཕུང་པོ་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Smṛtīndra will be born in a place called Luminous Mountain of Splendor.

source: ཡབ་ནི་མཐུ་རྩལ་གྲགས་ཞེས་བྱའོ། །
en: Famed Power will be his father.

source: ཡུམ་ནི་མྱ་ངན་ལས་འདས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Nirvāṇa will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་མར་མེ་སྐར་མདའ་ཞེས་བྱའོ། །
en: Comet of Dharma Light will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Excellence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་འདས་ཞེས་བྱའོ། །
en: Beyond the Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་ལྔའོ། །
en: There will be ninety consecutive congregations, each of them gathering twenty-five billion.

source: དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པའི་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་མཐའ་ཡས་བརྒྱན་ཞེས་བྱའོ། །
en: “The thus-gone Asaṅgadhvaja will be born in a place called Infinite Ornament.

source: ཡབ་ནི་ཟླ་བའི་གཟི་བརྗིད་མཐུ་ཞེས་བྱའོ། །
en: Power of the Moon’s Splendor will be his father.

source: ཡུམ་ནི་ཉི་མའི་གཟི་བརྗིད་ཕུང་པོའི་འོད་ཅེས་བྱའོ། །
en: Light of Masses of Sun’s Splendor will be his mother.

source: རིམ་གྲོ་པ་ནི་བརྟུལ་ཞུགས་རྫོགས་པ་ལྷ་མཆོད་གྲགས་ཞེས་བྱའོ། །
en: Perfect Yogic Discipline and Famed Divine Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྱོར་པའི་བློ་ཞེས་བྱའོ། །
en: Mental Wealth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ལྷ་ཡེ་ཤེས་མཐོང་ཞེས་བྱའོ། །
en: Seeing with the Wisdom of Universal Divinity will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་མཆོག་བགྲོད་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་སྣང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Varabodhigati will be born in a place called Light of Wisdom.

source: ཡབ་ནི་བསོད་ནམས་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Merit Leader will be his father.

source: ཡུམ་ནི་རིན་ཆེན་སྦྱིན་ཞེས་བྱའོ། །
en: Jewel Gift will be his mother.

source: སྲས་ནི་ང་རོ་བདེ་ཞེས་བྱའོ། །
en: Roar of Bliss will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་བྱང་ཆུབ་ཅེས་བྱའོ། །
en: Divine Awakening will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་བློ་ཞེས་བྱའོ། །
en: Universal Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be fourteen consecutive congregations, each of them gathering one million four hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་གསལ་སྐྱེ་བའི་ཡུལ་ནི་སྤྱོད་པ་དང་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Caraṇaprasanna will be born in a place called Endowed with Conduct.

source: ཡུམ་ནི་འབྱོར་པའི་འོད་ཅེས་བྱའོ། །
en: Light of Wealth will be his mother.

source: སྲས་ནི་རིན་ཆེན་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Jewel Crest Banner will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མཐའ་ཡས་མཛོད་ཅེས་བྱའོ། །
en: Treasury of Limitless Jewels will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་འབྱོར་ཞེས་བྱའོ། །
en: Flower Wealth will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be eleven consecutive congregations, each of them gathering nine hundred forty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བརྒྱད་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for eighty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བ་སྣང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnapriya will be born in a place called Moonlight.

source: ཡབ་ནི་ལེགས་མཐོང་སྒྲོན་མའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Lamp of Excellent Sight will be his father.

source: ཡུམ་ནི་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Limitless Light will be his mother.

source: སྲས་ནི་ཟླ་མཛེས་ཞེས་བྱའོ། །
en: Moon of Beauty will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་འོས་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader Worthy of Worship will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་གྲགས་པ་ཞེས་བྱའོ། །
en: Highly Renowned will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་དགུ་དགུའོ། །
en: There will be ninety-nine consecutive congregations, each of them gathering nine million.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབང་ཕྱུག་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: “The thus-gone Dharmeśvara will be born in a place called Banner of Merit.

source: ཡབ་ནི་སྒྲ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Sound will be his father.

source: སྲས་ནི་ཡེ་ཤེས་འབྱོར་ཅེས་བྱའོ། །
en: Wealth of Wisdom will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆགས་མེད་རྟོག་སྤོང་ཞེས་བྱའོ། །
en: Detached Relinquishment of Concepts will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་མཐུ་རྩལ་སྤྱོད་པའི་སྟོབས་ཞེས་བྱའོ། །
en: Strength of the Conduct of Lion Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be eighty consecutive congregations, each of them gathering eight hundred forty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་ཐམས་ཅད་སྐྱེ་བའི་ཡུལ་ནི་འོད་འཕྲོ་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Viśvadeva will be born in a place called Crest of Radiant Light.

source: ཡབ་ནི་ཟླ་མཐོང་ཞེས་བྱའོ། །
en: Moon Sight will be his father.

source: ཡུམ་ནི་ཡིད་འོང་མེ་ཏོག་ཅེས་བྱའོ། །
en: Delightful Flower will be his mother.

source: སྲས་ནི་ཐར་པའི་རྒྱན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Ornament Array of Liberation will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པ་ལ་དགའ་བའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Joy in Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་བརྟན་པོ་གཞན་གྱིས་མི་ཐུབ་པའི་སྟོབས་ཞེས་བྱའོ། །
en: Stable Power of Indomitable Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཀུན་ཏུ་གྲགས་ཤིང་རྣམ་པར་འཕྲུལ་པར་གྲགས་པའི་སྤོབས་པ་ཞེས་བྱའོ། །
en: Famed Qualities and Renowned Acumen for Miraculous Display will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་སྟོང་ཕྲག་བཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་ལྔ་བཅུའོ། །བཞི་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུའོ། །ལྔ་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བརྒྱའོ། །
en: In the first congregation there will be one hundred billion hearers; in the second there will be two hundred billion; in the third, five hundred billion; in the fourth, eight hundred million; and in the fifth, one trillion.

source: དེ་བཞིན་གཤེགས་པ་བཤེས་གཉེན་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་མཐའ་ཡས་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mahāmitra will be born in a place called Array of Infinite Jewels.

source: ཡབ་ནི་འཇིག་རྟེན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: Beyond the World will be his father.

source: ཡུམ་ནི་སྒྲོན་མ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Lamp will be his mother.

source: སྲས་ནི་ལེགས་མཐོང་བཟོད་ཅེས་བྱའོ། །
en: Acceptance of Excellent Sight will be his son.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་ཕུང་པོ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Limitless Mass of Splendor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་སྣང་བྱེད་འོད་ཅེས་བྱའོ། །
en: Illuminating Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་བཅོམ་གྲགས་ཞེས་བྱའོ། །
en: Famed Worthy One will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་དགུ་བཅུ་དགུའོ། །
en: There will be ninety consecutive congregations, each of them gathering nineteen billion.

source: དེ་བཞིན་གཤེགས་པ་བཤེས་གཉེན་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Sumitra will be born in a place called Great Splendor.

source: ཡབ་ནི་མི་གཡོ་བར་གནས་པ་ཞེས་བྱའོ། །
en: Immutable Abiding will be his father.

source: ཡུམ་ནི་མཆོད་པ་འབྱོར་ཅེས་བྱའོ། །
en: Wealth of Worship will be his mother.

source: སྲས་ནི་ཐར་པ་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་འདས་པའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of Nirvāṇa will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་བརྒྱན་ཅེས་བྱའོ། །
en: Adornment of Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྱོར་དགའ་སེང་གེའི་སྟོབས་ཞེས་བྱའོ། །
en: Wealth of Joyous Lion Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲི་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirteen consecutive congregations, each of them gathering ten quadrillion irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བའི་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་བཟང་མཆོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Praśāntagāmin will be born in a place called Offering of Excellent Land.

source: ཡབ་ནི་ཆོས་ཀྱི་ལྷ་ཞེས་བྱའོ། །
en: Dharma Divinity will be his father.

source: ཡུམ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Master of Delightful Melody will be his mother.

source: སྲས་ནི་དབང་པོ་དུལ་ཞེས་བྱའོ། །
en: Sense Control will be his son.

source: རིམ་གྲོ་པ་ནི་ས་གསལ་ཞེས་བྱའོ། །
en: Luminous Ground will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྣང་བ་མཐའ་ཡས་དཔལ་ཞེས་བྱའོ། །
en: Glory of Infinite Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལག་ན་རིན་ཆེན་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Jewel Crest Banner will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་བརྒྱད་དོ། །
en: There will be seventy consecutive congregations, each of them gathering nine hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་བདག་པོ་སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་སྤོང་ཞེས་བྱའོ། །
en: “The thus-gone Amṛtādhipa will be born in a place called Famed Relinquishment.

source: ཡབ་ནི་ཟབ་པར་གྲགས་ཞེས་བྱའོ། །
en: Famed for Profundity will be his father.

source: ཡུམ་ནི་དགྲ་བཅོམ་མཆོད་ཅེས་བྱའོ། །
en: Worship of the Worthy will be his mother.

source: སྲས་ནི་དགྲ་སྤོང་ང་རོ་ཞེས་བྱའོ། །
en: Roar That Relinquishes Enemies will be his son.

source: རིམ་གྲོ་པ་ནི་ཡུལ་གྲགས་ཞེས་བྱའོ། །
en: Famed Land will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་དཔལ་གྲགས་ཞེས་བྱའོ། །
en: Glory and Fame of the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་གྲགས་ཐར་པ་ཞེས་བྱའོ། །
en: Famed Divinity and Liberation will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་རི་བོ་བརྩེགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Meruprabha will be born in a place called Rising Mountain.

source: ཡུམ་ནི་འབྱོར་གྲགས་ཞེས་བྱའོ། །
en: Famed Wealth will be his mother.

source: སྲས་ནི་ཐར་པ་བརྩེགས་ཞེས་བྱའོ། །
en: Tiers of Liberation will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Divine Radiance will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of the Gods will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་ཐེར་འབུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be one billion consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་འཕགས་པས་བསྟོད་པ་སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Āryastuta will be born in a place called Famed Intelligence.

source: ཡབ་ནི་མཐའ་ཡས་སྦེད་ཅེས་བྱའོ། །
en: Concealed Infinity will be his father.

source: ཡུམ་ནི་གྲགས་པའི་ཕྲེང་བ་ཞེས་བྱའོ། །
en: Garland of Fame will be his mother.

source: སྲས་ནི་ལྷ་སྦེད་ཅེས་བྱའོ། །
en: Concealed Divinity will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་པ་སྤོང་ཞེས་བྱའོ། །
en: Famed Relinquishment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་ཀུན་གྱིས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the Entire World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་གྲགས་ཞེས་བྱའོ། །
en: Famed Teacher will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་འབུམ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be eighteen consecutive congregations, each of them gathering eighteen trillion.

source: དེ་བཞིན་གཤེགས་པ་སྣང་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཕུང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Jyotiṣmat will be born in a place called Splendid Hill.

source: ཡབ་ནི་ཟང་ཟིང་སྤངས་ཞེས་བྱའོ། །
en: Giving up Business will be his father.

source: ཡུམ་ནི་མཆོག་སྦྱིན་ཞེས་བྱའོ། །
en: Supreme Gift will be his mother.

source: སྲས་ནི་རྣམ་པར་གྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Famed King will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་རྡོ་རྗེ་ཞེས་བྱའོ། །
en: Vajra Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Nectar Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དེད་དཔོན་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Captain will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བདུན་བདུན་ནོ། །
en: There will be seventy consecutive congregations, each of them gathering sixty-seven billion.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་འབར་བ་སྐྱེ་བའི་ཡུལ་ནི་སྣང་བ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Dīptatejas will be born in a place called Infinite Light.

source: ཡབ་ནི་ལྷ་བདེ་ཞེས་བྱའོ། །
en: Divine Bliss will be his father.

source: ཡུམ་ནི་ཐར་པ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Liberation will be his mother.

source: སྲས་ནི་མྱ་ངན་ལས་འདས་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Nirvāṇa will be his son.

source: རིམ་གྲོ་པ་ནི་སྲེད་མེད་གྲགས་ཞེས་བྱའོ། །
en: Renowned Detachment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཉོན་མོངས་པ་མེད་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Freedom from Defilements will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་ཐམས་ཅད་དུ་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed in All Worlds will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ལྔ་བཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be seventy consecutive congregations, each of them gathering five hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་སྣང་བ་གཟིགས་སྐྱེ་བའི་ཡུལ་ནི་སྣང་བ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Avabhāsadarśin will be born in a place called Infinite Light.

source: ཡབ་ནི་འོད་ཟེར་ཡངས་པ་ཞེས་བྱའོ། །
en: Vast Radiance will be his father.

source: སྲས་ནི་བདུད་རྩི་བཀོད་པ་ཞེས་བྱའོ། །
en: Nectar Array will be his son.

source: རིམ་གྲོ་པ་ནི་བདེན་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Truth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མངོན་པར་ཤེས་པས་རྣམ་པར་བརྩེ་བ་ཞེས་བྱའོ། །
en: Reveling with Superknowledge will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be eighty consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་སྦྱང་རྣམ་པར་སྨིན་པ་སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་གསལ་བ་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Sucīrṇavipāka will be born in a place called Endowed with Clear Awakening.

source: ཡབ་ནི་ཡུལ་དགའ་ཞེས་བྱའོ། །
en: Land of Joy will be his father.

source: ཡུམ་ནི་བདུད་རྩིའི་གྲགས་ཞེས་བྱའོ། །
en: Famed Nectar will be his mother.

source: སྲས་ནི་ལྷ་བདེན་ཞེས་བྱའོ། །
en: Divine Truth will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་བསྡུས་ཞེས་བྱའོ། །
en: Gathering the World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐོང་བས་སྤོང་ཞེས་བྱའོ། །
en: Relinquishment through Seeing will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be forty consecutive congregations, each of them gathering four million two hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཟེར་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Supriya will be born in a place called Delightful Radiance.

source: ཡབ་ནི་ཆུ་ལྷའི་བདག་ཅེས་བྱའོ། །
en: Lord of the Water God will be his father.

source: ཡུམ་ནི་ཤེས་རབ་འཕགས་ཞེས་བྱའོ། །
en: Superior Insight will be his mother.

source: སྲས་ནི་བདེན་པའི་སྟོབས་ཞེས་བྱའོ། །
en: Strength of the Truth will be his son.

source: རིམ་གྲོ་པ་ནི་སེང་གེས་བྱིན་ཞེས་བྱའོ། །
en: Lion Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཟེར་མཆོག་ཅེས་བྱའོ། །
en: Supreme Radiance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་སྤངས་ཞེས་བྱའོ། །
en: Worship and Relinquishment will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be seventy consecutive congregations, each of them gathering thirty-two trillion.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་བྲལ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Vigataśoka will be born in a place called Delightful Splendor.

source: འོད་ནི་དཔག་ཚད་བདུན་ཁྲི་དགུ་སྟོང་ངོ་། །
en: His light will extend seventy-nine thousand leagues.

source: ཡབ་ནི་ཐར་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Liberation will be his father.

source: ཡུམ་ནི་འཕགས་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of the Noble will be his mother.

source: སྲས་ནི་ཡོན་ཏན་ཀུན་སྦེད་ཅེས་བྱའོ། །
en: Thoroughly Concealed Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance of Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Divine Lamp will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕུང་པོ་བཟང་པོ་འོད་ཅེས་བྱའོ། །
en: Light of Masses of Excellence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be thirty consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ཏུ་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Ratnaprabhāsa will be born in a place called Fully Endowed with Qualities.

source: ཡབ་ནི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Intelligence will be his father.

source: ཡུམ་ནི་ངེས་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Definitive Fame will be his mother.

source: སྲས་ནི་བདུད་རྩིའི་མིག་ཅེས་བྱའོ། །
en: Nectar Eye will be his son.

source: རིམ་གྲོ་པ་ནི་ཕྱོགས་གྲགས་རིན་ཆེན་ཞེས་བྱའོ། །
en: Jewel of Universal Renown will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་སྨད་གྲགས་ཞེས་བྱའོ། །
en: Famed as Irreproachable will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be twenty-two consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་དང་ལྡན་པ་སྐྱེ་བའི་ཡུལ་ནི་སྐྱེ་བོའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: “The thus-gone Cāritraka will be born in a place called Stūpa for Humanity.

source: ཡབ་ནི་རིན་ཆེན་གྲགས་ཞེས་བྱའོ། །
en: Famed Jewel will be his father.

source: ཡུམ་ནི་མེ་ཏོག་མན་དཱ་ར་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Mandāravā Flowers will be his mother.

source: སྲས་ནི་ལེགས་མཐོང་དགའ་ཞེས་བྱའོ། །
en: Joyful Excellent Sight will be his son.

source: རིམ་གྲོ་པ་ནི་མཐོང་ཆེན་བློ་གྲོས་གསལ་ཞེས་བྱའོ། །
en: Clear Intelligence of Vast Vision will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡུལ་འཁོར་ལྷ་སྦེད་ཅེས་བྱའོ། །
en: Concealed God of the Land will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསམ་སྦྱིན་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Giving as Wished will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be thirty-four consecutive congregations, each of them gathering seven hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-three thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ninety-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྟོབས་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་སྟེགས་ཞེས་བྱའོ། །
en: “The thus-gone Puṇyabala will be born in a place called Support for Masses of Merit.

source: ཡབ་ནི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Intelligence will be his father.

source: ཡུམ་ནི་སྙིང་རྗེའི་ཤུགས་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Force of Compassion will be his mother.

source: སྲས་ནི་སྙིང་སྟོབས་ཞུམ་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Mind of Dauntless Courage will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེས་རབ་ཏུ་བརྒྱན་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Jewel Adornment will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕྱོགས་བལྟ་གྲགས་ཞེས་བྱའོ། །
en: Famed Universal View will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་དགུ་དགུའོ། །
en: There will be seventy consecutive congregations, each of them gathering nine million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་མཚོ་སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་སྒྲོན་མ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇasāgara will be born in a place called Lamp of Awakening.

source: ཡབ་ནི་ཡོན་ཏན་མཐའ་ཡས་གྲགས་ཞེས་བྱའོ། །
en: Fame of Infinite Qualities will be his father.

source: ཡུམ་ནི་རིན་ཆེན་གྲགས་ཞེས་བྱའོ། །
en: Famed Jewel will be his mother.

source: སྲས་ནི་ལྷའི་གྲོང་ཁྱེར་གཙོ་ཞེས་བྱའོ། །
en: Foremost in the City of Gods will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེད་རྫོགས་འདུ་ཤེས་བརྟན་ཞེས་བྱའོ། །
en: Perfect Force and Stable Perception will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐོང་དགའ་བེའུ་ཞེས་བྱའོ། །
en: Calf of Delightful Sight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་སྐྱོན་མེད་ཅེས་བྱའོ། །
en: Flawless Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུའོ། །
en: There will be thirty consecutive congregations, each of them gathering nine hundred ninety million.
